validation/rhoLimKE/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices ( (0 0 0) (2 0 0) (2 0.8 0) (0 0.2 0) (0 0 0.05) (2 0 0.05) (2 0.8 0.05) (0 0.2 0.05) );
blocks ( hex (0 1 2 3 4 5 6 7) (60 20 1) simpleGrading (1 1 1) );
boundary
(
  inlet  { type patch; faces ( (0 4 7 3) ); }
  outlet { type patch; faces ( (1 2 6 5) ); }
  bottom { type wall;  faces ( (0 1 5 4) ); }
  slant  { type symmetryPlane; faces ( (3 7 6 2) ); }
  frontBack { type empty; faces ( (0 3 2 1) (4 5 6 7) ); }
);
