validation/rhoLimKE/0.orig/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField {
  inlet  { type fixedValue; value uniform 300; }
  outlet { type zeroGradient; }
  bottom { type fixedValue; value uniform 350; }
  slant  { type symmetryPlane; }
  frontBack { type empty; }
}
