validation/rhoLimKE/0.orig/epsilon
FoamFile { version 2.0; format ascii; class volScalarField; object epsilon; }
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.3369;
boundaryField {
  inlet  { type fixedValue; value uniform 0.3369; }
  outlet { type zeroGradient; }
  bottom { type epsilonWallFunction; value uniform 0.3369; }
  slant  { type symmetryPlane; }
  frontBack { type empty; }
}
