validation/rhoLimKE/0.orig/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.09375;
boundaryField {
  inlet  { type fixedValue; value uniform 0.09375; }
  outlet { type zeroGradient; }
  bottom { type kqRWallFunction; value uniform 0.09375; }
  slant  { type symmetryPlane; }
  frontBack { type empty; }
}
