validation/rhoLimKE/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField {
  inlet  { type calculated; value uniform 0; }
  outlet { type calculated; value uniform 0; }
  bottom { type nutkWallFunction; value uniform 0; }
  slant  { type symmetryPlane; }
  frontBack { type empty; }
}
